Revit 2027 API
BuiltInFailures.SystemsFailures.CreatePartsWithInvalidService Property
 Parts were not created because a system's service is undefined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CreatePartsWithInvalidService { get; }
Public Shared ReadOnly Property CreatePartsWithInvalidService As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CreatePartsWithInvalidService {
	FailureDefinitionId^ get ();
}
static member CreatePartsWithInvalidService : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace